Revit 2024 API
IFCFile.CreateInstance Method
 Creates an IFC instance in the file model.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IFCAnyHandle CreateInstance(
	string name
)
Visual Basic
Public Function CreateInstance ( _
	name As String _
) As IFCAnyHandle
Visual C++
public:
IFCAnyHandle^ CreateInstance(
	String^ name
)
Parameters
name
Type: System.String
 The instance name.
Return Value
 The instance handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCFile Class
Autodesk.Revit.DB.IFC Namespace